china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_mdm_stat.h
// field definitions
/// PHY_TX_ABORT_STAT field bit
#define MDM_PHY_TX_ABORT_STAT_BIT    ((uint32_t)0x00000001)
/// PHY_TX_ABORT_STAT field position
#define MDM_PHY_TX_ABORT_STAT_POS    0

/// PHY_TX_ABORT_STAT field reset value
#define MDM_PHY_TX_ABORT_STAT_RST    0x0

/**
 * @brief Returns the current value of the PhyTxAbortStat field in the TXFSMSTAT1 register.
 *
 * The TXFSMSTAT1 register will be read and the PhyTxAbortStat field's value will be returned.
 *
 * @return The current value of the PhyTxAbortStat field in the TXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_phy_tx_abort_stat_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXFSMSTAT1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000001)) == 0);
    return (localVal >> 0);
}

/// @}

/**
 * @name ERRSTAT register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     06           TXOVERFLOW   0
 *     05          TXFORMATERR   0
 *     04           TXUNDERRUN   0
 *     03            AGCUNLOCK   0
 *     02          RXFORMATERR   0
 *     01             HTSIGCRC   0
 *     00           LSIGPARITY   0
 * </pre>
 *
 * @{
 */

/// Address of the ERRSTAT register
#define MDM_ERRSTAT_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000020)
/// Offset of the ERRSTAT register from the base address
#define MDM_ERRSTAT_OFFSET 0x00000020
/// Index of the ERRSTAT register
#define MDM_ERRSTAT_INDEX  0x00000008
/// Reset value of the ERRSTAT register
#define MDM_ERRSTAT_RESET  0x00000000

/**
 * @brief Returns the current value of the ERRSTAT register.
 * The ERRSTAT register will be read and its value returned.
 * @return The current value of the ERRSTAT register.
 */
__INLINE uint32_t mdm_errstat_get(void)
{
    return REG_PL_RD(MDM_ERRSTAT_ADDR);
}

// field definitions
/// TXOVERFLOW field bit
#define MDM_TXOVERFLOW_BIT     ((uint32_t)0x00000040)
/// TXOVERFLOW field position
#define MDM_TXOVERFLOW_POS     6
/// TXFORMATERR field bit
#define MDM_TXFORMATERR_BIT    ((uint32_t)0x00000020)
/// TXFORMATERR field position
#define MDM_TXFORMATERR_POS    5
/// TXUNDERRUN field bit
#define MDM_TXUNDERRUN_BIT     ((uint32_t)0x00000010)
/// TXUNDERRUN field position
#define MDM_TXUNDERRUN_POS     4
/// AGCUNLOCK field bit
#define MDM_AGCUNLOCK_BIT      ((uint32_t)0x00000008)
/// AGCUNLOCK field position
#define MDM_AGCUNLOCK_POS      3
/// RXFORMATERR field bit
#define MDM_RXFORMATERR_BIT    ((uint32_t)0x00000004)
/// RXFORMATERR field position
#define MDM_RXFORMATERR_POS    2
/// HTSIGCRC field bit
#define MDM_HTSIGCRC_BIT       ((uint32_t)0x00000002)
/// HTSIGCRC field position
#define MDM_HTSIGCRC_POS       1
/// LSIGPARITY field bit
#define MDM_LSIGPARITY_BIT     ((uint32_t)0x00000001)
/// LSIGPARITY field position
#define MDM_LSIGPARITY_POS     0

/// TXOVERFLOW field reset value
#define MDM_TXOVERFLOW_RST     0x0
/// TXFORMATERR field reset value
#define MDM_TXFORMATERR_RST    0x0
/// TXUNDERRUN field reset value
#define MDM_TXUNDERRUN_RST     0x0
/// AGCUNLOCK field reset value
#define MDM_AGCUNLOCK_RST      0x0
/// RXFORMATERR field reset value
#define MDM_RXFORMATERR_RST    0x0
/// HTSIGCRC field reset value
#define MDM_HTSIGCRC_RST       0x0
/// LSIGPARITY field reset value
#define MDM_LSIGPARITY_RST     0x0

/**
 * @brief Unpacks ERRSTAT's fields from current value of the ERRSTAT register.
 *
 * Reads the ERRSTAT register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] txoverflow - Will be populated with the current value of this field from the register.
 * @param[out] txformaterr - Will be populated with the current value of this field from the register.
 * @param[out] txunderrun - Will be populated with the current value of this field from the register.
 * @param[out] agcunlock - Will be populated with the current value of this field from the register.
 * @param[out] rxformaterr - Will be populated with the current value of this field from the register.
 * @param[out] htsigcrc - Will be populated with the current value of this field from the register.
 * @param[out] lsigparity - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_errstat_unpack(uint8_t *txoverflow, uint8_t *txformaterr, uint8_t *txunderrun, uint8_t *agcunlock, uint8_t *rxformaterr, uint8_t *htsigcrc, uint8_t *lsigparity)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);

    *txoverflow = (localVal & ((uint32_t)0x00000040)) >> 6;
    *txformaterr = (localVal & ((uint32_t)0x00000020)) >> 5;
    *txunderrun = (localVal & ((uint32_t)0x00000010)) >> 4;
    *agcunlock = (localVal & ((uint32_t)0x00000008)) >> 3;
    *rxformaterr = (localVal & ((uint32_t)0x00000004)) >> 2;
    *htsigcrc = (localVal & ((uint32_t)0x00000002)) >> 1;
    *lsigparity = (localVal & ((uint32_t)0x00000001)) >> 0;
}

/**
 * @brief Returns the current value of the TXOVERFLOW field in the ERRSTAT register.
 *
 * The ERRSTAT register will be read and the TXOVERFLOW field's value will be returned.
 *
 * @return The current value of the TXOVERFLOW field in the ERRSTAT register.
 */
__INLINE uint8_t mdm_txoverflow_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

/**
 * @brief Returns the current value of the TXFORMATERR field in the ERRSTAT register.
 *
 * The ERRSTAT register will be read and the TXFORMATERR field's value will be returned.
 *
 * @return The current value of the TXFORMATERR field in the ERRSTAT register.
 */
__INLINE uint8_t mdm_txformaterr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

/**
 * @brief Returns the current value of the TXUNDERRUN field in the ERRSTAT register.
 *
 * The ERRSTAT register will be read and the TXUNDERRUN field's value will be returned.
 *
 * @return The current value of the TXUNDERRUN field in the ERRSTAT register.
 */
__INLINE uint8_t mdm_txunderrun_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

/**
 * @brief Returns the current value of the AGCUNLOCK field in the ERRSTAT register.
 *
 * The ERRSTAT register will be read and the AGCUNLOCK field's value will be returned.
 *
 * @return The current value of the AGCUNLOCK field in the ERRSTAT register.
 */
__INLINE uint8_t mdm_agcunlock_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

/**
 * @brief Returns the current value of the RXFORMATERR field in the ERRSTAT register.
 *
 * The ERRSTAT register will be read and the RXFORMATERR field's value will be returned.
 *
 * @return The current value of the RXFORMATERR field in the ERRSTAT register.
 */
__INLINE uint8_t mdm_rxformaterr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

/**
 * @brief Returns the current value of the HTSIGCRC field in the ERRSTAT register.
 *
 * The ERRSTAT register will be read and the HTSIGCRC field's value will be returned.
 *
 * @return The current value of the HTSIGCRC field in the ERRSTAT register.
 */
__INLINE uint8_t mdm_htsigcrc_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

/**
 * @brief Returns the current value of the LSIGPARITY field in the ERRSTAT register.
 *
 * The ERRSTAT register will be read and the LSIGPARITY field's value will be returned.
 *
 * @return The current value of the LSIGPARITY field in the ERRSTAT register.
 */
__INLINE uint8_t mdm_lsigparity_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_ERRSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/// @}

/**
 * @name IRQSTAT register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     14        IRQHTSIGVALID   0
 *     13         IRQLSIGVALID   0
 *     12        IRQTXOVERFLOW   0
 *     11        IRQTXUNDERRUN   0
 *     10        IRQCCA40SFALL   0
 *     09        IRQCCA40SRISE   0
 *     08             IRQTXEND   0
 *     07             IRQRXEND   0
 *     06        IRQCCA20PFALL   0
 *     05        IRQCCA20SFALL   0
 *     04        IRQCCA20PRISE   0
 *     03        IRQCCA20SRISE   0
 *     02          IRQPHYERROR   0
 *     01          IRQRADARDET   0
 *     00        IRQCCATIMEOUT   0
 * </pre>
 *
 * @{
 */

/// Address of the IRQSTAT register
#define MDM_IRQSTAT_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000024)
/// Offset of the IRQSTAT register from the base address
#define MDM_IRQSTAT_OFFSET 0x00000024
/// Index of the IRQSTAT register
#define MDM_IRQSTAT_INDEX  0x00000009
/// Reset value of the IRQSTAT register
#define MDM_IRQSTAT_RESET  0x00000000

/**
 * @brief Returns the current value of the IRQSTAT register.
 * The IRQSTAT register will be read and its value returned.
 * @return The current value of the IRQSTAT register.
 */
__INLINE uint32_t mdm_irqstat_get(void)
{
    return REG_PL_RD(MDM_IRQSTAT_ADDR);
}

