china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_mdm_stat.h
// field definitions
/// IRQHTSIGVALID field bit
#define MDM_IRQHTSIGVALID_BIT    ((uint32_t)0x00004000)
/// IRQHTSIGVALID field position
#define MDM_IRQHTSIGVALID_POS    14
/// IRQLSIGVALID field bit
#define MDM_IRQLSIGVALID_BIT     ((uint32_t)0x00002000)
/// IRQLSIGVALID field position
#define MDM_IRQLSIGVALID_POS     13
/// IRQTXOVERFLOW field bit
#define MDM_IRQTXOVERFLOW_BIT    ((uint32_t)0x00001000)
/// IRQTXOVERFLOW field position
#define MDM_IRQTXOVERFLOW_POS    12
/// IRQTXUNDERRUN field bit
#define MDM_IRQTXUNDERRUN_BIT    ((uint32_t)0x00000800)
/// IRQTXUNDERRUN field position
#define MDM_IRQTXUNDERRUN_POS    11
/// IRQCCA40SFALL field bit
#define MDM_IRQCCA40SFALL_BIT    ((uint32_t)0x00000400)
/// IRQCCA40SFALL field position
#define MDM_IRQCCA40SFALL_POS    10
/// IRQCCA40SRISE field bit
#define MDM_IRQCCA40SRISE_BIT    ((uint32_t)0x00000200)
/// IRQCCA40SRISE field position
#define MDM_IRQCCA40SRISE_POS    9
/// IRQTXEND field bit
#define MDM_IRQTXEND_BIT         ((uint32_t)0x00000100)
/// IRQTXEND field position
#define MDM_IRQTXEND_POS         8
/// IRQRXEND field bit
#define MDM_IRQRXEND_BIT         ((uint32_t)0x00000080)
/// IRQRXEND field position
#define MDM_IRQRXEND_POS         7
/// IRQCCA20PFALL field bit
#define MDM_IRQCCA20PFALL_BIT    ((uint32_t)0x00000040)
/// IRQCCA20PFALL field position
#define MDM_IRQCCA20PFALL_POS    6
/// IRQCCA20SFALL field bit
#define MDM_IRQCCA20SFALL_BIT    ((uint32_t)0x00000020)
/// IRQCCA20SFALL field position
#define MDM_IRQCCA20SFALL_POS    5
/// IRQCCA20PRISE field bit
#define MDM_IRQCCA20PRISE_BIT    ((uint32_t)0x00000010)
/// IRQCCA20PRISE field position
#define MDM_IRQCCA20PRISE_POS    4
/// IRQCCA20SRISE field bit
#define MDM_IRQCCA20SRISE_BIT    ((uint32_t)0x00000008)
/// IRQCCA20SRISE field position
#define MDM_IRQCCA20SRISE_POS    3
/// IRQPHYERROR field bit
#define MDM_IRQPHYERROR_BIT      ((uint32_t)0x00000004)
/// IRQPHYERROR field position
#define MDM_IRQPHYERROR_POS      2
/// IRQRADARDET field bit
#define MDM_IRQRADARDET_BIT      ((uint32_t)0x00000002)
/// IRQRADARDET field position
#define MDM_IRQRADARDET_POS      1
/// IRQCCATIMEOUT field bit
#define MDM_IRQCCATIMEOUT_BIT    ((uint32_t)0x00000001)
/// IRQCCATIMEOUT field position
#define MDM_IRQCCATIMEOUT_POS    0

/// IRQHTSIGVALID field reset value
#define MDM_IRQHTSIGVALID_RST    0x0
/// IRQLSIGVALID field reset value
#define MDM_IRQLSIGVALID_RST     0x0
/// IRQTXOVERFLOW field reset value
#define MDM_IRQTXOVERFLOW_RST    0x0
/// IRQTXUNDERRUN field reset value
#define MDM_IRQTXUNDERRUN_RST    0x0
/// IRQCCA40SFALL field reset value
#define MDM_IRQCCA40SFALL_RST    0x0
/// IRQCCA40SRISE field reset value
#define MDM_IRQCCA40SRISE_RST    0x0
/// IRQTXEND field reset value
#define MDM_IRQTXEND_RST         0x0
/// IRQRXEND field reset value
#define MDM_IRQRXEND_RST         0x0
/// IRQCCA20PFALL field reset value
#define MDM_IRQCCA20PFALL_RST    0x0
/// IRQCCA20SFALL field reset value
#define MDM_IRQCCA20SFALL_RST    0x0
/// IRQCCA20PRISE field reset value
#define MDM_IRQCCA20PRISE_RST    0x0
/// IRQCCA20SRISE field reset value
#define MDM_IRQCCA20SRISE_RST    0x0
/// IRQPHYERROR field reset value
#define MDM_IRQPHYERROR_RST      0x0
/// IRQRADARDET field reset value
#define MDM_IRQRADARDET_RST      0x0
/// IRQCCATIMEOUT field reset value
#define MDM_IRQCCATIMEOUT_RST    0x0

/**
 * @brief Unpacks IRQSTAT's fields from current value of the IRQSTAT register.
 *
 * Reads the IRQSTAT register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] irqhtsigvalid - Will be populated with the current value of this field from the register.
 * @param[out] irqlsigvalid - Will be populated with the current value of this field from the register.
 * @param[out] irqtxoverflow - Will be populated with the current value of this field from the register.
 * @param[out] irqtxunderrun - Will be populated with the current value of this field from the register.
 * @param[out] irqcca40sfall - Will be populated with the current value of this field from the register.
 * @param[out] irqcca40srise - Will be populated with the current value of this field from the register.
 * @param[out] irqtxend - Will be populated with the current value of this field from the register.
 * @param[out] irqrxend - Will be populated with the current value of this field from the register.
 * @param[out] irqcca20pfall - Will be populated with the current value of this field from the register.
 * @param[out] irqcca20sfall - Will be populated with the current value of this field from the register.
 * @param[out] irqcca20prise - Will be populated with the current value of this field from the register.
 * @param[out] irqcca20srise - Will be populated with the current value of this field from the register.
 * @param[out] irqphyerror - Will be populated with the current value of this field from the register.
 * @param[out] irqradardet - Will be populated with the current value of this field from the register.
 * @param[out] irqccatimeout - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_irqstat_unpack(uint8_t *irqhtsigvalid, uint8_t *irqlsigvalid, uint8_t *irqtxoverflow, uint8_t *irqtxunderrun, uint8_t *irqcca40sfall, uint8_t *irqcca40srise, uint8_t *irqtxend, uint8_t *irqrxend, uint8_t *irqcca20pfall, uint8_t *irqcca20sfall, uint8_t *irqcca20prise, uint8_t *irqcca20srise, uint8_t *irqphyerror, uint8_t *irqradardet, uint8_t *irqccatimeout)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);

    *irqhtsigvalid = (localVal & ((uint32_t)0x00004000)) >> 14;
    *irqlsigvalid = (localVal & ((uint32_t)0x00002000)) >> 13;
    *irqtxoverflow = (localVal & ((uint32_t)0x00001000)) >> 12;
    *irqtxunderrun = (localVal & ((uint32_t)0x00000800)) >> 11;
    *irqcca40sfall = (localVal & ((uint32_t)0x00000400)) >> 10;
    *irqcca40srise = (localVal & ((uint32_t)0x00000200)) >> 9;
    *irqtxend = (localVal & ((uint32_t)0x00000100)) >> 8;
    *irqrxend = (localVal & ((uint32_t)0x00000080)) >> 7;
    *irqcca20pfall = (localVal & ((uint32_t)0x00000040)) >> 6;
    *irqcca20sfall = (localVal & ((uint32_t)0x00000020)) >> 5;
    *irqcca20prise = (localVal & ((uint32_t)0x00000010)) >> 4;
    *irqcca20srise = (localVal & ((uint32_t)0x00000008)) >> 3;
    *irqphyerror = (localVal & ((uint32_t)0x00000004)) >> 2;
    *irqradardet = (localVal & ((uint32_t)0x00000002)) >> 1;
    *irqccatimeout = (localVal & ((uint32_t)0x00000001)) >> 0;
}

/**
 * @brief Returns the current value of the IRQHTSIGVALID field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQHTSIGVALID field's value will be returned.
 *
 * @return The current value of the IRQHTSIGVALID field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqhtsigvalid_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

/**
 * @brief Returns the current value of the IRQLSIGVALID field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQLSIGVALID field's value will be returned.
 *
 * @return The current value of the IRQLSIGVALID field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqlsigvalid_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

/**
 * @brief Returns the current value of the IRQTXOVERFLOW field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQTXOVERFLOW field's value will be returned.
 *
 * @return The current value of the IRQTXOVERFLOW field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqtxoverflow_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

/**
 * @brief Returns the current value of the IRQTXUNDERRUN field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQTXUNDERRUN field's value will be returned.
 *
 * @return The current value of the IRQTXUNDERRUN field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqtxunderrun_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

/**
 * @brief Returns the current value of the IRQCCA40SFALL field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQCCA40SFALL field's value will be returned.
 *
 * @return The current value of the IRQCCA40SFALL field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqcca40sfall_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

/**
 * @brief Returns the current value of the IRQCCA40SRISE field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQCCA40SRISE field's value will be returned.
 *
 * @return The current value of the IRQCCA40SRISE field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqcca40srise_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

/**
 * @brief Returns the current value of the IRQTXEND field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQTXEND field's value will be returned.
 *
 * @return The current value of the IRQTXEND field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqtxend_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

/**
 * @brief Returns the current value of the IRQRXEND field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQRXEND field's value will be returned.
 *
 * @return The current value of the IRQRXEND field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqrxend_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

/**
 * @brief Returns the current value of the IRQCCA20PFALL field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQCCA20PFALL field's value will be returned.
 *
 * @return The current value of the IRQCCA20PFALL field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqcca20pfall_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

/**
 * @brief Returns the current value of the IRQCCA20SFALL field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQCCA20SFALL field's value will be returned.
 *
 * @return The current value of the IRQCCA20SFALL field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqcca20sfall_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

/**
 * @brief Returns the current value of the IRQCCA20PRISE field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQCCA20PRISE field's value will be returned.
 *
 * @return The current value of the IRQCCA20PRISE field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqcca20prise_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

/**
 * @brief Returns the current value of the IRQCCA20SRISE field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQCCA20SRISE field's value will be returned.
 *
 * @return The current value of the IRQCCA20SRISE field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqcca20srise_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

/**
 * @brief Returns the current value of the IRQPHYERROR field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQPHYERROR field's value will be returned.
 *
 * @return The current value of the IRQPHYERROR field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqphyerror_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

/**
 * @brief Returns the current value of the IRQRADARDET field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQRADARDET field's value will be returned.
 *
 * @return The current value of the IRQRADARDET field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqradardet_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

/**
 * @brief Returns the current value of the IRQCCATIMEOUT field in the IRQSTAT register.
 *
 * The IRQSTAT register will be read and the IRQCCATIMEOUT field's value will be returned.
 *
 * @return The current value of the IRQCCATIMEOUT field in the IRQSTAT register.
 */
__INLINE uint8_t mdm_irqccatimeout_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_IRQSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/// @}

/**
 * @name RXVECTOR0 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:12            RXLEGRATE   0x0
 *  11:00          RXLEGLENGTH   0x0
 * </pre>
 *
 * @{
 */

