china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_mdm_stat.h
// field definitions
/// RSSI4 field mask
#define MDM_RSSI4_MASK   ((uint32_t)0xFF000000)
/// RSSI4 field LSB position
#define MDM_RSSI4_LSB    24
/// RSSI4 field width
#define MDM_RSSI4_WIDTH  ((uint32_t)0x00000008)
/// RSSI3 field mask
#define MDM_RSSI3_MASK   ((uint32_t)0x00FF0000)
/// RSSI3 field LSB position
#define MDM_RSSI3_LSB    16
/// RSSI3 field width
#define MDM_RSSI3_WIDTH  ((uint32_t)0x00000008)
/// RSSI2 field mask
#define MDM_RSSI2_MASK   ((uint32_t)0x0000FF00)
/// RSSI2 field LSB position
#define MDM_RSSI2_LSB    8
/// RSSI2 field width
#define MDM_RSSI2_WIDTH  ((uint32_t)0x00000008)
/// RSSI1 field mask
#define MDM_RSSI1_MASK   ((uint32_t)0x000000FF)
/// RSSI1 field LSB position
#define MDM_RSSI1_LSB    0
/// RSSI1 field width
#define MDM_RSSI1_WIDTH  ((uint32_t)0x00000008)

/// RSSI4 field reset value
#define MDM_RSSI4_RST    0x0
/// RSSI3 field reset value
#define MDM_RSSI3_RST    0x0
/// RSSI2 field reset value
#define MDM_RSSI2_RST    0x0
/// RSSI1 field reset value
#define MDM_RSSI1_RST    0x0

/**
 * @brief Unpacks RXVECTOR3's fields from current value of the RXVECTOR3 register.
 *
 * Reads the RXVECTOR3 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] rssi4 - Will be populated with the current value of this field from the register.
 * @param[out] rssi3 - Will be populated with the current value of this field from the register.
 * @param[out] rssi2 - Will be populated with the current value of this field from the register.
 * @param[out] rssi1 - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxvector3_unpack(uint8_t *rssi4, uint8_t *rssi3, uint8_t *rssi2, uint8_t *rssi1)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR3_ADDR);

    *rssi4 = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *rssi3 = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *rssi2 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *rssi1 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

/**
 * @brief Returns the current value of the RSSI4 field in the RXVECTOR3 register.
 *
 * The RXVECTOR3 register will be read and the RSSI4 field's value will be returned.
 *
 * @return The current value of the RSSI4 field in the RXVECTOR3 register.
 */
__INLINE uint8_t mdm_rssi4_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

/**
 * @brief Returns the current value of the RSSI3 field in the RXVECTOR3 register.
 *
 * The RXVECTOR3 register will be read and the RSSI3 field's value will be returned.
 *
 * @return The current value of the RSSI3 field in the RXVECTOR3 register.
 */
__INLINE uint8_t mdm_rssi3_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

/**
 * @brief Returns the current value of the RSSI2 field in the RXVECTOR3 register.
 *
 * The RXVECTOR3 register will be read and the RSSI2 field's value will be returned.
 *
 * @return The current value of the RSSI2 field in the RXVECTOR3 register.
 */
__INLINE uint8_t mdm_rssi2_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

/**
 * @brief Returns the current value of the RSSI1 field in the RXVECTOR3 register.
 *
 * The RXVECTOR3 register will be read and the RSSI1 field's value will be returned.
 *
 * @return The current value of the RSSI1 field in the RXVECTOR3 register.
 */
__INLINE uint8_t mdm_rssi1_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/// @}

/**
 * @name RXVECTOR4 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:24            RXGROUPID   0x0
 *  20:12         RXPARTIALAID   0x0
 *  07:00                 RCPI   0x0
 * </pre>
 *
 * @{
 */

/// Address of the RXVECTOR4 register
#define MDM_RXVECTOR4_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000038)
/// Offset of the RXVECTOR4 register from the base address
#define MDM_RXVECTOR4_OFFSET 0x00000038
/// Index of the RXVECTOR4 register
#define MDM_RXVECTOR4_INDEX  0x0000000E
/// Reset value of the RXVECTOR4 register
#define MDM_RXVECTOR4_RESET  0x00000000

/**
 * @brief Returns the current value of the RXVECTOR4 register.
 * The RXVECTOR4 register will be read and its value returned.
 * @return The current value of the RXVECTOR4 register.
 */
__INLINE uint32_t mdm_rxvector4_get(void)
{
    return REG_PL_RD(MDM_RXVECTOR4_ADDR);
}

// field definitions
/// RXGROUPID field mask
#define MDM_RXGROUPID_MASK      ((uint32_t)0x3F000000)
/// RXGROUPID field LSB position
#define MDM_RXGROUPID_LSB       24
/// RXGROUPID field width
#define MDM_RXGROUPID_WIDTH     ((uint32_t)0x00000006)
/// RXPARTIALAID field mask
#define MDM_RXPARTIALAID_MASK   ((uint32_t)0x001FF000)
/// RXPARTIALAID field LSB position
#define MDM_RXPARTIALAID_LSB    12
/// RXPARTIALAID field width
#define MDM_RXPARTIALAID_WIDTH  ((uint32_t)0x00000009)
/// RCPI field mask
#define MDM_RCPI_MASK           ((uint32_t)0x000000FF)
/// RCPI field LSB position
#define MDM_RCPI_LSB            0
/// RCPI field width
#define MDM_RCPI_WIDTH          ((uint32_t)0x00000008)

/// RXGROUPID field reset value
#define MDM_RXGROUPID_RST       0x0
/// RXPARTIALAID field reset value
#define MDM_RXPARTIALAID_RST    0x0
/// RCPI field reset value
#define MDM_RCPI_RST            0x0

/**
 * @brief Unpacks RXVECTOR4's fields from current value of the RXVECTOR4 register.
 *
 * Reads the RXVECTOR4 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] rxgroupid - Will be populated with the current value of this field from the register.
 * @param[out] rxpartialaid - Will be populated with the current value of this field from the register.
 * @param[out] rcpi - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxvector4_unpack(uint8_t *rxgroupid, uint16_t *rxpartialaid, uint8_t *rcpi)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR4_ADDR);

    *rxgroupid = (localVal & ((uint32_t)0x3F000000)) >> 24;
    *rxpartialaid = (localVal & ((uint32_t)0x001FF000)) >> 12;
    *rcpi = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

/**
 * @brief Returns the current value of the RXGROUPID field in the RXVECTOR4 register.
 *
 * The RXVECTOR4 register will be read and the RXGROUPID field's value will be returned.
 *
 * @return The current value of the RXGROUPID field in the RXVECTOR4 register.
 */
__INLINE uint8_t mdm_rxgroupid_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR4_ADDR);
    return ((localVal & ((uint32_t)0x3F000000)) >> 24);
}

/**
 * @brief Returns the current value of the RXPARTIALAID field in the RXVECTOR4 register.
 *
 * The RXVECTOR4 register will be read and the RXPARTIALAID field's value will be returned.
 *
 * @return The current value of the RXPARTIALAID field in the RXVECTOR4 register.
 */
__INLINE uint16_t mdm_rxpartialaid_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR4_ADDR);
    return ((localVal & ((uint32_t)0x001FF000)) >> 12);
}

/**
 * @brief Returns the current value of the RCPI field in the RXVECTOR4 register.
 *
 * The RXVECTOR4 register will be read and the RCPI field's value will be returned.
 *
 * @return The current value of the RCPI field in the RXVECTOR4 register.
 */
__INLINE uint8_t mdm_rcpi_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR4_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/// @}

/**
 * @name RXVECTOR5 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24                 EVM4   0x0
 *  23:16                 EVM3   0x0
 *  15:08                 EVM2   0x0
 *  07:00                 EVM1   0x0
 * </pre>
 *
 * @{
 */

