china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_mdm_stat.h
/// Address of the RXVECTOR5 register
#define MDM_RXVECTOR5_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x0000003C)
/// Offset of the RXVECTOR5 register from the base address
#define MDM_RXVECTOR5_OFFSET 0x0000003C
/// Index of the RXVECTOR5 register
#define MDM_RXVECTOR5_INDEX  0x0000000F
/// Reset value of the RXVECTOR5 register
#define MDM_RXVECTOR5_RESET  0x00000000

/**
 * @brief Returns the current value of the RXVECTOR5 register.
 * The RXVECTOR5 register will be read and its value returned.
 * @return The current value of the RXVECTOR5 register.
 */
__INLINE uint32_t mdm_rxvector5_get(void)
{
    return REG_PL_RD(MDM_RXVECTOR5_ADDR);
}

// field definitions
/// EVM4 field mask
#define MDM_EVM4_MASK   ((uint32_t)0xFF000000)
/// EVM4 field LSB position
#define MDM_EVM4_LSB    24
/// EVM4 field width
#define MDM_EVM4_WIDTH  ((uint32_t)0x00000008)
/// EVM3 field mask
#define MDM_EVM3_MASK   ((uint32_t)0x00FF0000)
/// EVM3 field LSB position
#define MDM_EVM3_LSB    16
/// EVM3 field width
#define MDM_EVM3_WIDTH  ((uint32_t)0x00000008)
/// EVM2 field mask
#define MDM_EVM2_MASK   ((uint32_t)0x0000FF00)
/// EVM2 field LSB position
#define MDM_EVM2_LSB    8
/// EVM2 field width
#define MDM_EVM2_WIDTH  ((uint32_t)0x00000008)
/// EVM1 field mask
#define MDM_EVM1_MASK   ((uint32_t)0x000000FF)
/// EVM1 field LSB position
#define MDM_EVM1_LSB    0
/// EVM1 field width
#define MDM_EVM1_WIDTH  ((uint32_t)0x00000008)

/// EVM4 field reset value
#define MDM_EVM4_RST    0x0
/// EVM3 field reset value
#define MDM_EVM3_RST    0x0
/// EVM2 field reset value
#define MDM_EVM2_RST    0x0
/// EVM1 field reset value
#define MDM_EVM1_RST    0x0

/**
 * @brief Unpacks RXVECTOR5's fields from current value of the RXVECTOR5 register.
 *
 * Reads the RXVECTOR5 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] evm4 - Will be populated with the current value of this field from the register.
 * @param[out] evm3 - Will be populated with the current value of this field from the register.
 * @param[out] evm2 - Will be populated with the current value of this field from the register.
 * @param[out] evm1 - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxvector5_unpack(uint8_t *evm4, uint8_t *evm3, uint8_t *evm2, uint8_t *evm1)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR5_ADDR);

    *evm4 = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *evm3 = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *evm2 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *evm1 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

/**
 * @brief Returns the current value of the EVM4 field in the RXVECTOR5 register.
 *
 * The RXVECTOR5 register will be read and the EVM4 field's value will be returned.
 *
 * @return The current value of the EVM4 field in the RXVECTOR5 register.
 */
__INLINE uint8_t mdm_evm4_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR5_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

/**
 * @brief Returns the current value of the EVM3 field in the RXVECTOR5 register.
 *
 * The RXVECTOR5 register will be read and the EVM3 field's value will be returned.
 *
 * @return The current value of the EVM3 field in the RXVECTOR5 register.
 */
__INLINE uint8_t mdm_evm3_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR5_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

/**
 * @brief Returns the current value of the EVM2 field in the RXVECTOR5 register.
 *
 * The RXVECTOR5 register will be read and the EVM2 field's value will be returned.
 *
 * @return The current value of the EVM2 field in the RXVECTOR5 register.
 */
__INLINE uint8_t mdm_evm2_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR5_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

/**
 * @brief Returns the current value of the EVM1 field in the RXVECTOR5 register.
 *
 * The RXVECTOR5 register will be read and the EVM1 field's value will be returned.
 *
 * @return The current value of the EVM1 field in the RXVECTOR5 register.
 */
__INLINE uint8_t mdm_evm1_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR5_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/// @}

/**
 * @name TXVECTOR0 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24             SMMINDEX   0x0
 *  23:16         TXANTENNASET   0x0
 *  13:12               TXCHBW   0x0
 *     11          TXSMOOTHING   0
 *     10              TXDYNBW   0
 *     09          TXFECCODING   0
 *     08           TXSOUNDING   0
 *  07:00            TXPWLEVEL   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TXVECTOR0 register
#define MDM_TXVECTOR0_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000040)
/// Offset of the TXVECTOR0 register from the base address
#define MDM_TXVECTOR0_OFFSET 0x00000040
/// Index of the TXVECTOR0 register
#define MDM_TXVECTOR0_INDEX  0x00000010
/// Reset value of the TXVECTOR0 register
#define MDM_TXVECTOR0_RESET  0x00000000

/**
 * @brief Returns the current value of the TXVECTOR0 register.
 * The TXVECTOR0 register will be read and its value returned.
 * @return The current value of the TXVECTOR0 register.
 */
__INLINE uint32_t mdm_txvector0_get(void)
{
    return REG_PL_RD(MDM_TXVECTOR0_ADDR);
}

// field definitions
/// SMMINDEX field mask
#define MDM_SMMINDEX_MASK       ((uint32_t)0xFF000000)
/// SMMINDEX field LSB position
#define MDM_SMMINDEX_LSB        24
/// SMMINDEX field width
#define MDM_SMMINDEX_WIDTH      ((uint32_t)0x00000008)
/// TXANTENNASET field mask
#define MDM_TXANTENNASET_MASK   ((uint32_t)0x00FF0000)
/// TXANTENNASET field LSB position
#define MDM_TXANTENNASET_LSB    16
/// TXANTENNASET field width
#define MDM_TXANTENNASET_WIDTH  ((uint32_t)0x00000008)
/// TXCHBW field mask
#define MDM_TXCHBW_MASK         ((uint32_t)0x00003000)
/// TXCHBW field LSB position
#define MDM_TXCHBW_LSB          12
/// TXCHBW field width
#define MDM_TXCHBW_WIDTH        ((uint32_t)0x00000002)
/// TXSMOOTHING field bit
#define MDM_TXSMOOTHING_BIT     ((uint32_t)0x00000800)
/// TXSMOOTHING field position
#define MDM_TXSMOOTHING_POS     11
/// TXDYNBW field bit
#define MDM_TXDYNBW_BIT         ((uint32_t)0x00000400)
/// TXDYNBW field position
#define MDM_TXDYNBW_POS         10
/// TXFECCODING field bit
#define MDM_TXFECCODING_BIT     ((uint32_t)0x00000200)
/// TXFECCODING field position
#define MDM_TXFECCODING_POS     9
/// TXSOUNDING field bit
#define MDM_TXSOUNDING_BIT      ((uint32_t)0x00000100)
/// TXSOUNDING field position
#define MDM_TXSOUNDING_POS      8
/// TXPWLEVEL field mask
#define MDM_TXPWLEVEL_MASK      ((uint32_t)0x000000FF)
/// TXPWLEVEL field LSB position
#define MDM_TXPWLEVEL_LSB       0
/// TXPWLEVEL field width
#define MDM_TXPWLEVEL_WIDTH     ((uint32_t)0x00000008)

/// SMMINDEX field reset value
#define MDM_SMMINDEX_RST        0x0
/// TXANTENNASET field reset value
#define MDM_TXANTENNASET_RST    0x0
/// TXCHBW field reset value
#define MDM_TXCHBW_RST          0x0
/// TXSMOOTHING field reset value
#define MDM_TXSMOOTHING_RST     0x0
/// TXDYNBW field reset value
#define MDM_TXDYNBW_RST         0x0
/// TXFECCODING field reset value
#define MDM_TXFECCODING_RST     0x0
/// TXSOUNDING field reset value
#define MDM_TXSOUNDING_RST      0x0
/// TXPWLEVEL field reset value
#define MDM_TXPWLEVEL_RST       0x0

/**
 * @brief Unpacks TXVECTOR0's fields from current value of the TXVECTOR0 register.
 *
 * Reads the TXVECTOR0 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] smmindex - Will be populated with the current value of this field from the register.
 * @param[out] txantennaset - Will be populated with the current value of this field from the register.
 * @param[out] txchbw - Will be populated with the current value of this field from the register.
 * @param[out] txsmoothing - Will be populated with the current value of this field from the register.
 * @param[out] txdynbw - Will be populated with the current value of this field from the register.
 * @param[out] txfeccoding - Will be populated with the current value of this field from the register.
 * @param[out] txsounding - Will be populated with the current value of this field from the register.
 * @param[out] txpwlevel - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_txvector0_unpack(uint8_t *smmindex, uint8_t *txantennaset, uint8_t *txchbw, uint8_t *txsmoothing, uint8_t *txdynbw, uint8_t *txfeccoding, uint8_t *txsounding, uint8_t *txpwlevel)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);

    *smmindex = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *txantennaset = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *txchbw = (localVal & ((uint32_t)0x00003000)) >> 12;
    *txsmoothing = (localVal & ((uint32_t)0x00000800)) >> 11;
    *txdynbw = (localVal & ((uint32_t)0x00000400)) >> 10;
    *txfeccoding = (localVal & ((uint32_t)0x00000200)) >> 9;
    *txsounding = (localVal & ((uint32_t)0x00000100)) >> 8;
    *txpwlevel = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

/**
 * @brief Returns the current value of the SMMINDEX field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the SMMINDEX field's value will be returned.
 *
 * @return The current value of the SMMINDEX field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_smmindex_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

/**
 * @brief Returns the current value of the TXANTENNASET field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the TXANTENNASET field's value will be returned.
 *
 * @return The current value of the TXANTENNASET field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_txantennaset_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

/**
 * @brief Returns the current value of the TXCHBW field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the TXCHBW field's value will be returned.
 *
 * @return The current value of the TXCHBW field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_txchbw_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x00003000)) >> 12);
}

/**
 * @brief Returns the current value of the TXSMOOTHING field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the TXSMOOTHING field's value will be returned.
 *
 * @return The current value of the TXSMOOTHING field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_txsmoothing_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

/**
 * @brief Returns the current value of the TXDYNBW field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the TXDYNBW field's value will be returned.
 *
 * @return The current value of the TXDYNBW field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_txdynbw_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

/**
 * @brief Returns the current value of the TXFECCODING field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the TXFECCODING field's value will be returned.
 *
 * @return The current value of the TXFECCODING field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_txfeccoding_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

/**
 * @brief Returns the current value of the TXSOUNDING field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the TXSOUNDING field's value will be returned.
 *
 * @return The current value of the TXSOUNDING field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_txsounding_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

/**
 * @brief Returns the current value of the TXPWLEVEL field in the TXVECTOR0 register.
 *
 * The TXVECTOR0 register will be read and the TXPWLEVEL field's value will be returned.
 *
 * @return The current value of the TXPWLEVEL field in the TXVECTOR0 register.
 */
__INLINE uint8_t mdm_txpwlevel_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/// @}

/**
 * @name TXVECTOR1 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  22:20             TXNUMSTS   0x0
 *  17:16           TXNUMEXTSS   0x0
 *  14:12             TXFORMAT   0x0
 *     08              PRETYPE   0
 *  06:00                TXMCS   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TXVECTOR1 register
#define MDM_TXVECTOR1_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000044)
/// Offset of the TXVECTOR1 register from the base address
#define MDM_TXVECTOR1_OFFSET 0x00000044
/// Index of the TXVECTOR1 register
#define MDM_TXVECTOR1_INDEX  0x00000011
/// Reset value of the TXVECTOR1 register
#define MDM_TXVECTOR1_RESET  0x00000000

/**
 * @brief Returns the current value of the TXVECTOR1 register.
 * The TXVECTOR1 register will be read and its value returned.
 * @return The current value of the TXVECTOR1 register.
 */
__INLINE uint32_t mdm_txvector1_get(void)
{
    return REG_PL_RD(MDM_TXVECTOR1_ADDR);
}

