china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_mdm_stat.h
// field definitions
/// TXNUMSTS field mask
#define MDM_TXNUMSTS_MASK     ((uint32_t)0x00700000)
/// TXNUMSTS field LSB position
#define MDM_TXNUMSTS_LSB      20
/// TXNUMSTS field width
#define MDM_TXNUMSTS_WIDTH    ((uint32_t)0x00000003)
/// TXNUMEXTSS field mask
#define MDM_TXNUMEXTSS_MASK   ((uint32_t)0x00030000)
/// TXNUMEXTSS field LSB position
#define MDM_TXNUMEXTSS_LSB    16
/// TXNUMEXTSS field width
#define MDM_TXNUMEXTSS_WIDTH  ((uint32_t)0x00000002)
/// TXFORMAT field mask
#define MDM_TXFORMAT_MASK     ((uint32_t)0x00007000)
/// TXFORMAT field LSB position
#define MDM_TXFORMAT_LSB      12
/// TXFORMAT field width
#define MDM_TXFORMAT_WIDTH    ((uint32_t)0x00000003)
/// PRETYPE field bit
#define MDM_PRETYPE_BIT       ((uint32_t)0x00000100)
/// PRETYPE field position
#define MDM_PRETYPE_POS       8
/// TXMCS field mask
#define MDM_TXMCS_MASK        ((uint32_t)0x0000007F)
/// TXMCS field LSB position
#define MDM_TXMCS_LSB         0
/// TXMCS field width
#define MDM_TXMCS_WIDTH       ((uint32_t)0x00000007)

/// TXNUMSTS field reset value
#define MDM_TXNUMSTS_RST      0x0
/// TXNUMEXTSS field reset value
#define MDM_TXNUMEXTSS_RST    0x0
/// TXFORMAT field reset value
#define MDM_TXFORMAT_RST      0x0
/// PRETYPE field reset value
#define MDM_PRETYPE_RST       0x0
/// TXMCS field reset value
#define MDM_TXMCS_RST         0x0

/**
 * @brief Unpacks TXVECTOR1's fields from current value of the TXVECTOR1 register.
 *
 * Reads the TXVECTOR1 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] txnumsts - Will be populated with the current value of this field from the register.
 * @param[out] txnumextss - Will be populated with the current value of this field from the register.
 * @param[out] txformat - Will be populated with the current value of this field from the register.
 * @param[out] pretype - Will be populated with the current value of this field from the register.
 * @param[out] txmcs - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_txvector1_unpack(uint8_t *txnumsts, uint8_t *txnumextss, uint8_t *txformat, uint8_t *pretype, uint8_t *txmcs)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR1_ADDR);

    *txnumsts = (localVal & ((uint32_t)0x00700000)) >> 20;
    *txnumextss = (localVal & ((uint32_t)0x00030000)) >> 16;
    *txformat = (localVal & ((uint32_t)0x00007000)) >> 12;
    *pretype = (localVal & ((uint32_t)0x00000100)) >> 8;
    *txmcs = (localVal & ((uint32_t)0x0000007F)) >> 0;
}

/**
 * @brief Returns the current value of the TXNUMSTS field in the TXVECTOR1 register.
 *
 * The TXVECTOR1 register will be read and the TXNUMSTS field's value will be returned.
 *
 * @return The current value of the TXNUMSTS field in the TXVECTOR1 register.
 */
__INLINE uint8_t mdm_txnumsts_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x00700000)) >> 20);
}

/**
 * @brief Returns the current value of the TXNUMEXTSS field in the TXVECTOR1 register.
 *
 * The TXVECTOR1 register will be read and the TXNUMEXTSS field's value will be returned.
 *
 * @return The current value of the TXNUMEXTSS field in the TXVECTOR1 register.
 */
__INLINE uint8_t mdm_txnumextss_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

/**
 * @brief Returns the current value of the TXFORMAT field in the TXVECTOR1 register.
 *
 * The TXVECTOR1 register will be read and the TXFORMAT field's value will be returned.
 *
 * @return The current value of the TXFORMAT field in the TXVECTOR1 register.
 */
__INLINE uint8_t mdm_txformat_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

/**
 * @brief Returns the current value of the PRETYPE field in the TXVECTOR1 register.
 *
 * The TXVECTOR1 register will be read and the PRETYPE field's value will be returned.
 *
 * @return The current value of the PRETYPE field in the TXVECTOR1 register.
 */
__INLINE uint8_t mdm_pretype_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

/**
 * @brief Returns the current value of the TXMCS field in the TXVECTOR1 register.
 *
 * The TXVECTOR1 register will be read and the TXMCS field's value will be returned.
 *
 * @return The current value of the TXMCS field in the TXVECTOR1 register.
 */
__INLINE uint8_t mdm_txmcs_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

/// @}

/**
 * @name TXVECTOR2 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16              SERVICE   0x0
 *  15:12            TXLEGRATE   0x0
 *  11:00          TXLEGLENTGH   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TXVECTOR2 register
#define MDM_TXVECTOR2_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000048)
/// Offset of the TXVECTOR2 register from the base address
#define MDM_TXVECTOR2_OFFSET 0x00000048
/// Index of the TXVECTOR2 register
#define MDM_TXVECTOR2_INDEX  0x00000012
/// Reset value of the TXVECTOR2 register
#define MDM_TXVECTOR2_RESET  0x00000000

/**
 * @brief Returns the current value of the TXVECTOR2 register.
 * The TXVECTOR2 register will be read and its value returned.
 * @return The current value of the TXVECTOR2 register.
 */
__INLINE uint32_t mdm_txvector2_get(void)
{
    return REG_PL_RD(MDM_TXVECTOR2_ADDR);
}

// field definitions
/// SERVICE field mask
#define MDM_SERVICE_MASK       ((uint32_t)0xFFFF0000)
/// SERVICE field LSB position
#define MDM_SERVICE_LSB        16
/// SERVICE field width
#define MDM_SERVICE_WIDTH      ((uint32_t)0x00000010)
/// TXLEGRATE field mask
#define MDM_TXLEGRATE_MASK     ((uint32_t)0x0000F000)
/// TXLEGRATE field LSB position
#define MDM_TXLEGRATE_LSB      12
/// TXLEGRATE field width
#define MDM_TXLEGRATE_WIDTH    ((uint32_t)0x00000004)
/// TXLEGLENTGH field mask
#define MDM_TXLEGLENTGH_MASK   ((uint32_t)0x00000FFF)
/// TXLEGLENTGH field LSB position
#define MDM_TXLEGLENTGH_LSB    0
/// TXLEGLENTGH field width
#define MDM_TXLEGLENTGH_WIDTH  ((uint32_t)0x0000000C)

/// SERVICE field reset value
#define MDM_SERVICE_RST        0x0
/// TXLEGRATE field reset value
#define MDM_TXLEGRATE_RST      0x0
/// TXLEGLENTGH field reset value
#define MDM_TXLEGLENTGH_RST    0x0

/**
 * @brief Unpacks TXVECTOR2's fields from current value of the TXVECTOR2 register.
 *
 * Reads the TXVECTOR2 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] service - Will be populated with the current value of this field from the register.
 * @param[out] txlegrate - Will be populated with the current value of this field from the register.
 * @param[out] txleglentgh - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_txvector2_unpack(uint16_t *service, uint8_t *txlegrate, uint16_t *txleglentgh)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR2_ADDR);

    *service = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *txlegrate = (localVal & ((uint32_t)0x0000F000)) >> 12;
    *txleglentgh = (localVal & ((uint32_t)0x00000FFF)) >> 0;
}

/**
 * @brief Returns the current value of the SERVICE field in the TXVECTOR2 register.
 *
 * The TXVECTOR2 register will be read and the SERVICE field's value will be returned.
 *
 * @return The current value of the SERVICE field in the TXVECTOR2 register.
 */
__INLINE uint16_t mdm_service_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

/**
 * @brief Returns the current value of the TXLEGRATE field in the TXVECTOR2 register.
 *
 * The TXVECTOR2 register will be read and the TXLEGRATE field's value will be returned.
 *
 * @return The current value of the TXLEGRATE field in the TXVECTOR2 register.
 */
__INLINE uint8_t mdm_txlegrate_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x0000F000)) >> 12);
}

/**
 * @brief Returns the current value of the TXLEGLENTGH field in the TXVECTOR2 register.
 *
 * The TXVECTOR2 register will be read and the TXLEGLENTGH field's value will be returned.
 *
 * @return The current value of the TXLEGLENTGH field in the TXVECTOR2 register.
 */
__INLINE uint16_t mdm_txleglentgh_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00000FFF)) >> 0);
}

/// @}

/**
 * @name TXVECTOR3 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:28               TXSTBC   0x0
 *  26:24                  NTX   0x0
 *     22            TXSHORTGI   0
 *     21     TXDOZENOTALLOWED   0
 *     20             TXAGGREG   0
 *  19:00           TXHTLENGTH   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TXVECTOR3 register
#define MDM_TXVECTOR3_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x0000004C)
/// Offset of the TXVECTOR3 register from the base address
#define MDM_TXVECTOR3_OFFSET 0x0000004C
/// Index of the TXVECTOR3 register
#define MDM_TXVECTOR3_INDEX  0x00000013
/// Reset value of the TXVECTOR3 register
#define MDM_TXVECTOR3_RESET  0x00000000

/**
 * @brief Returns the current value of the TXVECTOR3 register.
 * The TXVECTOR3 register will be read and its value returned.
 * @return The current value of the TXVECTOR3 register.
 */
__INLINE uint32_t mdm_txvector3_get(void)
{
    return REG_PL_RD(MDM_TXVECTOR3_ADDR);
}

