china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_mdm_stat.h
// field definitions
/// TXGROUPID field mask
#define MDM_TXGROUPID_MASK      ((uint32_t)0x0003F000)
/// TXGROUPID field LSB position
#define MDM_TXGROUPID_LSB       12
/// TXGROUPID field width
#define MDM_TXGROUPID_WIDTH     ((uint32_t)0x00000006)
/// TXPARTIALAID field mask
#define MDM_TXPARTIALAID_MASK   ((uint32_t)0x000001FF)
/// TXPARTIALAID field LSB position
#define MDM_TXPARTIALAID_LSB    0
/// TXPARTIALAID field width
#define MDM_TXPARTIALAID_WIDTH  ((uint32_t)0x00000009)

/// TXGROUPID field reset value
#define MDM_TXGROUPID_RST       0x0
/// TXPARTIALAID field reset value
#define MDM_TXPARTIALAID_RST    0x0

/**
 * @brief Unpacks TXVECTOR4's fields from current value of the TXVECTOR4 register.
 *
 * Reads the TXVECTOR4 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] txgroupid - Will be populated with the current value of this field from the register.
 * @param[out] txpartialaid - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_txvector4_unpack(uint8_t *txgroupid, uint16_t *txpartialaid)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR4_ADDR);

    *txgroupid = (localVal & ((uint32_t)0x0003F000)) >> 12;
    *txpartialaid = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

/**
 * @brief Returns the current value of the TXGROUPID field in the TXVECTOR4 register.
 *
 * The TXVECTOR4 register will be read and the TXGROUPID field's value will be returned.
 *
 * @return The current value of the TXGROUPID field in the TXVECTOR4 register.
 */
__INLINE uint8_t mdm_txgroupid_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR4_ADDR);
    return ((localVal & ((uint32_t)0x0003F000)) >> 12);
}

/**
 * @brief Returns the current value of the TXPARTIALAID field in the TXVECTOR4 register.
 *
 * The TXVECTOR4 register will be read and the TXPARTIALAID field's value will be returned.
 *
 * @return The current value of the TXPARTIALAID field in the TXVECTOR4 register.
 */
__INLINE uint16_t mdm_txpartialaid_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR4_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

/// @}

/**
 * @name TXVECDECSTAT register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     07          TXVECGI2ERR   0
 *     06           TXVECBWERR   0
 *     05         MTXVECGI1ERR   0
 *     04          TXVECMCSERR   0
 *     03          TXVECLEGERR   0
 *     02         TXVECNULLERR   0
 *     01          TXLECLENERR   0
 *     00        TXVECSOUNDERR   0
 * </pre>
 *
 * @{
 */

/// Address of the TXVECDECSTAT register
#define MDM_TXVECDECSTAT_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000054)
/// Offset of the TXVECDECSTAT register from the base address
#define MDM_TXVECDECSTAT_OFFSET 0x00000054
/// Index of the TXVECDECSTAT register
#define MDM_TXVECDECSTAT_INDEX  0x00000015
/// Reset value of the TXVECDECSTAT register
#define MDM_TXVECDECSTAT_RESET  0x00000000

/**
 * @brief Returns the current value of the TXVECDECSTAT register.
 * The TXVECDECSTAT register will be read and its value returned.
 * @return The current value of the TXVECDECSTAT register.
 */
__INLINE uint32_t mdm_txvecdecstat_get(void)
{
    return REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
}

// field definitions
/// TXVECGI2ERR field bit
#define MDM_TXVECGI2ERR_BIT      ((uint32_t)0x00000080)
/// TXVECGI2ERR field position
#define MDM_TXVECGI2ERR_POS      7
/// TXVECBWERR field bit
#define MDM_TXVECBWERR_BIT       ((uint32_t)0x00000040)
/// TXVECBWERR field position
#define MDM_TXVECBWERR_POS       6
/// MTXVECGI1ERR field bit
#define MDM_MTXVECGI1ERR_BIT     ((uint32_t)0x00000020)
/// MTXVECGI1ERR field position
#define MDM_MTXVECGI1ERR_POS     5
/// TXVECMCSERR field bit
#define MDM_TXVECMCSERR_BIT      ((uint32_t)0x00000010)
/// TXVECMCSERR field position
#define MDM_TXVECMCSERR_POS      4
/// TXVECLEGERR field bit
#define MDM_TXVECLEGERR_BIT      ((uint32_t)0x00000008)
/// TXVECLEGERR field position
#define MDM_TXVECLEGERR_POS      3
/// TXVECNULLERR field bit
#define MDM_TXVECNULLERR_BIT     ((uint32_t)0x00000004)
/// TXVECNULLERR field position
#define MDM_TXVECNULLERR_POS     2
/// TXLECLENERR field bit
#define MDM_TXLECLENERR_BIT      ((uint32_t)0x00000002)
/// TXLECLENERR field position
#define MDM_TXLECLENERR_POS      1
/// TXVECSOUNDERR field bit
#define MDM_TXVECSOUNDERR_BIT    ((uint32_t)0x00000001)
/// TXVECSOUNDERR field position
#define MDM_TXVECSOUNDERR_POS    0

/// TXVECGI2ERR field reset value
#define MDM_TXVECGI2ERR_RST      0x0
/// TXVECBWERR field reset value
#define MDM_TXVECBWERR_RST       0x0
/// MTXVECGI1ERR field reset value
#define MDM_MTXVECGI1ERR_RST     0x0
/// TXVECMCSERR field reset value
#define MDM_TXVECMCSERR_RST      0x0
/// TXVECLEGERR field reset value
#define MDM_TXVECLEGERR_RST      0x0
/// TXVECNULLERR field reset value
#define MDM_TXVECNULLERR_RST     0x0
/// TXLECLENERR field reset value
#define MDM_TXLECLENERR_RST      0x0
/// TXVECSOUNDERR field reset value
#define MDM_TXVECSOUNDERR_RST    0x0

/**
 * @brief Unpacks TXVECDECSTAT's fields from current value of the TXVECDECSTAT register.
 *
 * Reads the TXVECDECSTAT register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] txvecgi2err - Will be populated with the current value of this field from the register.
 * @param[out] txvecbwerr - Will be populated with the current value of this field from the register.
 * @param[out] mtxvecgi1err - Will be populated with the current value of this field from the register.
 * @param[out] txvecmcserr - Will be populated with the current value of this field from the register.
 * @param[out] txveclegerr - Will be populated with the current value of this field from the register.
 * @param[out] txvecnullerr - Will be populated with the current value of this field from the register.
 * @param[out] txleclenerr - Will be populated with the current value of this field from the register.
 * @param[out] txvecsounderr - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_txvecdecstat_unpack(uint8_t *txvecgi2err, uint8_t *txvecbwerr, uint8_t *mtxvecgi1err, uint8_t *txvecmcserr, uint8_t *txveclegerr, uint8_t *txvecnullerr, uint8_t *txleclenerr, uint8_t *txvecsounderr)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);

    *txvecgi2err = (localVal & ((uint32_t)0x00000080)) >> 7;
    *txvecbwerr = (localVal & ((uint32_t)0x00000040)) >> 6;
    *mtxvecgi1err = (localVal & ((uint32_t)0x00000020)) >> 5;
    *txvecmcserr = (localVal & ((uint32_t)0x00000010)) >> 4;
    *txveclegerr = (localVal & ((uint32_t)0x00000008)) >> 3;
    *txvecnullerr = (localVal & ((uint32_t)0x00000004)) >> 2;
    *txleclenerr = (localVal & ((uint32_t)0x00000002)) >> 1;
    *txvecsounderr = (localVal & ((uint32_t)0x00000001)) >> 0;
}

/**
 * @brief Returns the current value of the TXVECGI2ERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the TXVECGI2ERR field's value will be returned.
 *
 * @return The current value of the TXVECGI2ERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_txvecgi2err_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

/**
 * @brief Returns the current value of the TXVECBWERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the TXVECBWERR field's value will be returned.
 *
 * @return The current value of the TXVECBWERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_txvecbwerr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

/**
 * @brief Returns the current value of the MTXVECGI1ERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the MTXVECGI1ERR field's value will be returned.
 *
 * @return The current value of the MTXVECGI1ERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_mtxvecgi1err_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

/**
 * @brief Returns the current value of the TXVECMCSERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the TXVECMCSERR field's value will be returned.
 *
 * @return The current value of the TXVECMCSERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_txvecmcserr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

/**
 * @brief Returns the current value of the TXVECLEGERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the TXVECLEGERR field's value will be returned.
 *
 * @return The current value of the TXVECLEGERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_txveclegerr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

/**
 * @brief Returns the current value of the TXVECNULLERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the TXVECNULLERR field's value will be returned.
 *
 * @return The current value of the TXVECNULLERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_txvecnullerr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

/**
 * @brief Returns the current value of the TXLECLENERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the TXLECLENERR field's value will be returned.
 *
 * @return The current value of the TXLECLENERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_txleclenerr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

/**
 * @brief Returns the current value of the TXVECSOUNDERR field in the TXVECDECSTAT register.
 *
 * The TXVECDECSTAT register will be read and the TXVECSOUNDERR field's value will be returned.
 *
 * @return The current value of the TXVECSOUNDERR field in the TXVECDECSTAT register.
 */
__INLINE uint8_t mdm_txvecsounderr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECDECSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/// @}

/**
 * @name MIMOCMDSTAT register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24            MIMOCMDP3   0x0
 *  23:16            MIMOCMDP2   0x0
 *  15:08            MIMOCMDP1   0x0
 *  07:00              MIMOCMD   0x0
 * </pre>
 *
 * @{
 */

/// Address of the MIMOCMDSTAT register
#define MDM_MIMOCMDSTAT_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000058)
/// Offset of the MIMOCMDSTAT register from the base address
#define MDM_MIMOCMDSTAT_OFFSET 0x00000058
/// Index of the MIMOCMDSTAT register
#define MDM_MIMOCMDSTAT_INDEX  0x00000016
/// Reset value of the MIMOCMDSTAT register
#define MDM_MIMOCMDSTAT_RESET  0x00000000

/**
 * @brief Returns the current value of the MIMOCMDSTAT register.
 * The MIMOCMDSTAT register will be read and its value returned.
 * @return The current value of the MIMOCMDSTAT register.
 */
__INLINE uint32_t mdm_mimocmdstat_get(void)
{
    return REG_PL_RD(MDM_MIMOCMDSTAT_ADDR);
}

